import React from 'react'
import {View,Text,ScrollView,SafeAreaView, TouchableOpacity,Image} from 'react-native'
import Icon from 'react-native-vector-icons/FontAwesome';
export default class Terms extends React.Component{
    Goto = () => {
        var page = "Login"
        const {changePage}=this.props;
        this.changePage= changePage;
        this.changePage(page);
    }
    render(){
        return(
            <SafeAreaView>
                <View>
                <View style={{alignItems:'flex-start',justifyContent:'center',backgroundColor:'#182e68'}}>
                <View
                    style={{
                        flexDirection: 'row',
                        alignItems: 'center',
                        height: 50,
                        backgroundColor: '#182e68',
                        paddingLeft: 10,
                        justifyContent: 'space-between'
                    }}>
                    <TouchableOpacity onPress={this.Goto}>
                        <Icon name="chevron-left" color="#FFF" size={30} />
                    </TouchableOpacity>
                    <View style={{marginLeft:120}}/>
                    <Image
                        source={require('../assets/image/logo.png')}
                        style={{ width: 50, height: 50 }}
                    />
                </View>
                <ScrollView>
                    <View style={{alignItems:'center',justifyContent:'center',backgroundColor:'#fff',padding:30}}>
                        <Text style={{textAlign:'left',fontSize:12}}>
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>เงื่อนไขการและสัญญาการให้บริการออลการ์ด (All Card)</Text>{'\n\n'}
                            <Text>           </Text>สัญญานี้เป็นสัญญาระหว่างบริษัท อิสระเสรี จำกัดซึ่งมีสำนักงานใหญ่ตั้งอยู่เลขที่657 ประชาราษฎ์บำเพ็ญ ซอย 23 สามเสนนอก ห้วยขวาง กรุงเทพ 10310 
                            โทรศัพท์ 02-275-8886ทะเบียนนิติบุคคลเลขที่0105560023425ผู้ให้บริการปัจจุบันกำลังดำเนินการขออนุญาตให้ประกอบธุรกิจบัตรเงินอิเล็กทรอนิกส์ถูกต้องตามกฎหมายจากกระทรวงการคลัง 
                            (ซึ่งต่อไปนี้จะเรียกว่า “บริษัท” ฝ่ายหนึ่ง) กับผู้สมัครขอใช้บริการออลการ์ด (All Card) (ซึ่งต่อไปในสัญญานี้จะเรียกว่า “ท่าน”) อีกฝ่ายหนึ่งเพื่อขอใช้บริการออลการ์ด (All Card)หรือบริการ
                            อื่นๆที่เกี่ยวข้องโดยที่บริษัทให้บริการท่านในการทำธุรกรรมทางอิเล็กทรอนิกส์และการให้บริการออลการ์ด (All Card)ช่องทางการให้บริการบริษัทจัดทำบริการดังกล่าวขึ้นเพื่อสนับสนุนการ
                            ทำธุรกรรมทางพาณิชย์อิเล็กทรอนิกส์กระเป๋าเงินอิเลคทรอนิกส์ (e-Money*) และบริการเป็นตัวแทนรับชำระเงินหรือค่าบริการ (e-Payment) เพื่ออำนวยความสะดวกให้แก่ท่านโดยที่ท่าน
                            ประสงค์ขอใช้บริการออลการ์ด (All Card)ของบริษัทเพื่อทำธุรกรรมทางพาณิชย์อิเล็กทรอนิกส์กระเป๋าเงินอิเลคทรอนิกส์ (e-Money*) และบริการเป็นตัวแทนรับชำระเงินหรือค่าบริการ 
                            (e-Payment) เพื่อความสะดวกของท่านการคลิก “ ยอมรับ ” หรือ “ ยืนยัน ” หรือ “ ตกลง ” เพื่อการส่งข้อมูลการชำระเงินผ่านบริการออลการ์ด (All Card)ถือว่าท่านได้ยอมรับข้อ
                            ตกลงและเงื่อนไขต่างๆตามที่กำหนดไว้ในสัญญานี้รวมทั้งสิทธิความเป็นส่วนตัวของท่านและ/หรือเอกสารอ้างอิงอื่นๆนอกจากนี้ยังถือว่าท่านยอมรับว่าสัญญานี้เป็นสัญญาระหว่างบริษัทกับท่าน
                            โดยท่านเป็นผู้ลงนามให้มีผลผูกพันและบังคับได้ตามกฎหมายสิทธิใดๆที่ไม่ได้ระบุไว้ในสัญญานี้บริษัทขอสงวนสิทธิที่จะแก้ไขเพิ่มเติมหรือเปลี่ยนแปลงได้ตามความเหมาะสมและความเห็นชอบ
                            ของบริษัทโดยบริษัทจะแจ้งให้ท่านทราบทางที่อยู่จดหมายอิเล็กทรอนิกส์ที่ท่านได้แจ้งไว้และถือว่าท่านยินยอมในการแก้ไขเพิ่มเติมหรือเปลี่ยนแปลงเงื่อนไขตามสัญญาหากมิได้เป็นการฝ่าฝืน
                            หรือล่วงละเมิดต่อบทบัญญัติแห่งกฎหมายซึ่งท่านยินยอมและยอมรับโดยไม่เรียกร้องค่าเสียหายใดๆไม่ว่าการแก้ไขเพิ่มเติมหรือเปลี่ยนแปลงสัญญานั้นจะเป็นเพียงบางส่วนและ/หรือทั้งหมดและ
                            คู่สัญญาทั้งสองฝ่ายตกลงให้ถือว่าข้อตกลงและเงื่อนไขที่แก้ไขใหม่นี้มีผลใช้บังคับแทนข้อตกลงและเงื่อนไขเดิมทันทีโดยอัตโนมัติซึ่งเนื้อหาสาระส่วนที่แก้ไขเพิ่มเติมหรือเปลี่ยนแปลงจะถูกประ
                            กาศบนเว็บไซต์ https://allcard.appและช่องทางการให้บริการในกรณีที่มีการเปลี่ยนแปลงค่าธรรมเนียมบริษัทจะแจ้งให้ท่านทราบล่วงหน้าไม่น้อยกว่า 30 วันก่อนจะมีผลใช้บังคับดังนั้นคู่
                            สัญญาจึงตกลงกันดังต่อไปนี้{'\n\n'}
                            <Text>           </Text>คำนิยามศัพท์และการตีความคำว่า “ธนาคาร” ให้หมายความรวมถึงสถาบันที่รับเงินฝากคำว่า “บัตรเครดิต” ให้หมายความรวมถึงบัตรวีซ่าบัตรเดบิตวีซ่า (Visa Debit) บัตรมาสเตอร์การ์ดบัตร
                            เดบิตมาสเตอร์การ์ด (Maestro) และบัตรเงินอิเล็กทรอนิกส์อื่นๆด้วยคำว่า “การดำเนินการทางกฎหมาย” หมายความรวมถึงการบอกกล่าวทวงถามค่าทนายความค่าธรรมเนียมศาลค่าป่วยการค่าพาหนะ
                            เป็นต้นคำว่า “เหตุสุดวิสัย” หมายความรวมถึงคอมพิวเตอร์ไวรัสความล่าช้าซึ่งเกิดจากระบบของธนาคารไฟฟ้าหรือระบบโทรคมนาคมบกพร่องอัคคีภัยอุทกภัยภัยธรรมชาติอื่นสงครามจลาจลประท้วงเป็นต้น
                            รวมถึงความเสียหายจากภาวะขาดทุนการเปิดเผยข้อมูลที่ทำให้ท่านไม่สามารถใช้บริการบริษัทหรือเว็บไซต์บริษัทได้คำว่า “รายการต้องสงสัย” หมายความรวมถึงรายการได้กระทำผิดสัญญาหรือรายการที่
                            ได้กระทำผิดกฎหมายรายการที่บุคคลธรรมดานิติบุคคลองค์กรหน่วยงานต่างๆที่เกี่ยวข้องแจ้งขอความร่วมมือให้ดำเนินการระงับการทำรายการมายังบริษัทและรวมถึงกรณีที่เป็นรายการที่สงสัยว่าไม่ถูกต้อง
                            สมบูรณ์ตามผลการทำรายการเช่นรายการที่เติมเงินสำเร็จแต่ไม่มีรายการเข้าระบบออลการ์ด (All Card)ซึ่งเป็นปัญหาทางด้านเทคนิคที่เกิดจากการเติมผ่านบัตรระบบเกิดจากการเติมเงินผ่านช่องทางที่
                            ไม่ได้มีการตอบสนองทางจอภาพในทันที (Real Time Interface) หรือเกิดจากรายการที่ผิดพลาดโดยเจ้าหน้าที่ออลการ์ด (All Card)ซึ่งปัญหาทางด้านเทคนิคดังกล่าวรวมถึงปัญหาทางด้านที
                            เทคนิคที่เกิดจากระบบคอมพิวเตอร์หรือเจ้าหน้าที่หรือบุคคลากรอื่นด้วยคำว่า “ค่าธรรมเนียม” หมายความรวมถึงค่าธรรมเนียมการเติมเงินผ่านช่องทางต่างๆค่าธรรมเนียมจากการใช้บริการชำระเงินค่าสินค้า
                            และบริการค่าธรรมเนียมในการปิดบัญชีค่าธรรมเนียมในการรักษาบัญชีที่ไม่เคลื่อนไหวคำว่า “ระบบคอมพิวเตอร์” หมายความรวมถึงระบบอินเตอร์เน็ตระบบฮาร์ดแวร์และระบบซอฟต์แวร์คำว่า “เชื่อมโยงเว็บไซต์” 
                            (Framing) หมายความว่าการที่เว็บไซต์ทำการสร้าง frame ขึ้นมาบนหน้าเว็บเสมือนทำให้หน้าเว็บอีกหน้าหนึ่งมีการเชื่อมต่อไปยังหน้าเว็บอื่นๆ (มีเว็บที่แยกต่างหากภายในหน้าเดียวกันโดยกำหนดกรอบการ
                            นำเสนอในเว็บเพจที่แบ่งหน้าต่างไม่ทับซ้อนกันหลายหน้าต่างแต่ละบานมีการแสดงจาก HTML ที่แยกต่างหาก) โดยในการเชื่อมต่อนี้อาจมีการมีความเสี่ยงซ่อนอยู่อาจมีการซ่อนไวรัสไว้ที่ทำให้การเชื่อมต่อไป
                            ยังหน้าเว็บแล้วไม่ได้หน้าเว็บตามที่ต้องการและอาจทำให้ผู้ที่เชื่อมต่อไปยังลิ้งค์เว็บนั้นๆเกิดความเสี่ยงในการถูกโจรกรรมข้อมูลทางธุรกิจเช่นรหัสผู้ใช้ (Username) รหัสผ่าน (Password) ที่ใช้ในการทำธุร
                            กรรมบนอินเตอร์เน็ตเป็นต้นคำว่า “พฤติกรรมเสี่ยงที่ต่อการก่อให้เกิดความเสียหาย” หมายความถึงพฤติกรรมเสี่ยงที่อาจก่อให้เกิดความเสียหายต่อบริการรายงานการใช้บัตรเครดิตที่ท่านไม่ได้เป็นเจ้าของหรือ
                            ไม่ได้รับอนุญาตซึ่งบริษัทได้รับและ/หรือตรวจสอบพบจากข้อมูลของธนาคารรายงานเกี่ยวกับการรับเงินของท่านที่มาจากแหล่งเงินอันมีที่มาจากการกระทำความผิดต่อกฎหมายอาญาในข้อหาหรือฐานความผิดใดๆ
                            จากบัญชีธนาคารหรือบัตรเครดิตของบุคคลอื่นการได้รับรายงานด้านการเงินของท่านที่มีอัตราความเสี่ยงอยู่ในระดับสูงจากหน่วยงานด้านข้อมูลเครดิตการทำธุรกรรมหรือการมีส่วนร่วมในการกระทำอันมีวัตถุประสงค์
                            เพื่อเป็นการเบิกเงินล่วงหน้าจากบัตรเครดิตการปฏิเสธการให้ความร่วมมือกับบริษัทในการตรวจสอบหรือการปฏิเสธการให้ข้อมูลที่ถูกร้องขอการส่งไปรษณีย์เล็กทรอนิกส์ (E-Mail) ที่ไม่พึงประสงค์หรือการแนะนำ
                            เว็บไซต์ (Referral Link) ที่ไม่ได้รับอนุญาตการเปิดบัญชีออลการ์ด (All Card)หลายบัญชีการใช้บัญชีออลการ์ด (All Card)เพื่อการกระทำผิดกฎหมายในทุกกรณีการปกปิดข้อมูล Proxy การได้รับราย
                            งานร้องเรียนที่เกี่ยวข้องกับการใช้บริการออลการ์ด (All Card)ของท่านอย่างต่อเนื่องคำว่า “ลายลักษณ์อักษร” หมายความรวมถึงการส่งไปรษณีย์อิเล็กทรอนิกส์คำว่า “ช่องทางการให้บริการ” หมายความรวม
                            ถึงบนเว็บไซต์https://allcard.app โปรแกรมบนโทรศัพท์มือถือสมาร์ทโฟนแทบเล็ตและอุปกรณ์พกพาอื่นๆ (Application on Mobile, Smart Phone, Table and other mobile devices) 
                            และเครื่องให้บริการอัตโนมัติ (KIOSK) โดยรวมถึงช่องทางการให้บริการอื่นๆที่บริษัทจะประกาศให้ทราบล่วงหน้าไม่น้อยกว่า 30 วันคำว่า “ไปรษณีย์อิเล็กทรอนิกส์ที่ไม่พึงประสงค์” หมายความรวมถึงสแปมจังค์
                            เมลล์ไปรษณีย์เล็กทรอนิกส์ที่มีไวรัสอนึ่งเงื่อนไขและข้อตกลงในการใช้เว็บไซต์นี้และ/หรือเงื่อนไขและข้อตกลงการใช้บริการอื่นใดที่ปรากฎบนเว็บไซต์นี้อยู่ภายใต้บังคับแห่งกฎหมายไทยและไม่อยู่ภายใต้การขัดกัน
                            ของกฎหมาย{'\n\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 1 ความสัมพันธ์ทางกฎหมายระหว่างผู้สมัครขอใช้บริการกับบริษัท อิสระเสรี จำกัด</Text>{'\n\n'}
                            <Text>           </Text>บริการออลการ์ด (All Card)จัดทำขึ้นเพื่อสนับสนุนกิจกรรมทางพาณิชย์อิเล็กทรอนิกส์การทำธุรกรรมทางการเงินต่างๆและ/หรือค่าบริการบางรายอาจมีปัญหาและความเสี่ยงซึ่งท่านได้ศึกษาและทำความเข้าใจเป็น
                            อย่างดีแล้วและยอมรับความเสี่ยงต่อความชอบด้วยกฎหมายการมีผลสมบูรณ์การบังคับได้สภาพและมูลค่าสินค้าที่ตั้งหรือข้อเท็จจริงอื่นใดเกี่ยวกับสินค้าความสามารถในการชำระหนี้และความสามารถในการชำระเงินหรือ
                            สินค้าคืนในสัญญานี้บริษัทเป็นเพียงผู้ให้บริการท่านในการให้บริการอำนวยความสะดวกแก่ท่านในการชำระเงินเท่านั้นโดยบริษัทจะดำเนินการตามความประสงค์และความยินยอมของท่านภายใต้วิธีการเงื่อนไขและข้อกำ
                            หนดแห่งสัญญานี้บริษัทไม่ใช่ธนาคารไม่ใช่ผู้บริหารผลประโยชน์ในเงินทุนของท่านแต่ทำหน้าที่เป็นผู้ให้บริการในการชำระเงินของท่าน (เงินสกุลบาท) เท่านั้นบริษัทจะรวมเงินทุนของท่านกับเงินทุนของผู้ใช้บริการท่าน
                            อื่นๆไว้ในบัญชีธนาคาร (บัญชีรวม) ที่บริษัทเป็นเจ้าของโดยแยกต่างหากจากเงินทุนที่บริษัทใช้ในการดำเนินการและบริษัทจะไม่นำไปใช้ในวัตถุประสงค์อื่นของบริษัท{'\n\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 2 สิทธิหน้าที่ภาระผูกพันและความรับผิดชอบของท่าน</Text>{'\n\n'}
                            <Text>   </Text>2.1 สิทธิและหน้าที่ในการใช้บริการท่านมีสิทธิใช้บริการออลการ์ด (All Card)ก็ต่อเมื่อท่านได้สมัครเปิดบัญชีออลการ์ด (All Card)โดยท่านสามารถใช้บริการเพื่อส่งเงินของท่านไปยังผู้รับตามที่ท่านได้ระบุไว้โดยชำระจากบัตร
                            เครดิตหรือหักจากบัญชีเงินฝากโดยท่านอาจใช้บริการในรูปแบบของผู้รับเงินที่ได้จากการชำระค่าสินค่าหรือบริการออลการ์ด (All Card)ในการรับหรือส่งเงินในการกิจการทางการค้าทุกประเภทอนึ่งในกรณีที่มีการทำรายการใดๆหรือกระทำการใดๆโดยใช้
                            รหัสผ่าน (Password) ของท่านให้ถือว่าเป็นการกระทำโดยตัวของท่านเองทุกประการซึ่งท่านยอมรับว่าไม่สามารถยกเลิกเพิกถอนเปลี่ยนแปลงหรือแก้ไขการทำรายการใดๆได้และท่านตกลงผูกพันตามรายการดังกล่าวทุกประการโดยบริษัทไม่ต้องรับผิดชอบ
                            ในความเสียหายที่เกิดขึ้นจากการทำรายการใดๆภายใต้บัญชีของท่านจากการใช้รหัสผ่าน (Password) ดังกล่าวนั้นในทางกลับกันท่านจะต้องเป็นผู้รับผิดจากการทำรายการใดๆหรือการกระทำใดๆโดยใช้รหัสผ่านของท่าน{'\n'}
                            <Text>   </Text>2.2 หน้าที่ในการแจ้งข้อความจริงท่านตกลงให้ข้อมูลการลงทะเบียนที่ถูกต้องครบถ้วนและพร้อมที่จะแจ้งข้อมูลที่ตรงต่อความเป็นจริงและเป็นข้อมูลในปัจจุบันและทำให้ข้อมูลเป็นปัจจุบันให้แก่ระบบของออลการ์ด (All Card)รวมทั้ง
                            ท่านจะไม่ใช้ข้อมูลของบุคคลอื่นในการลงทะเบียนในกรณีข้อมูลที่ท่านแจ้งข้อความอันเป็นเท็จหรือควรบอกแจ้งให้ทราบหรือข้อมูลที่ไม่ใช่ข้อมูลในปัจจุบันหรือไม่ทำให้ข้อมูลเป็นปัจจุบันบริษัทมีสิทธิระงับการให้บริการกับท่านทันทีโดยมิต้องแจ้งให้ท่าน{'\n'}ทราบ{'\n'}
                            <Text>   </Text>2.3 หน้าที่ในการห้ามใช้บัญชีซ้อนท่านจะต้องไม่ทำการเปิดบัญชีออลการ์ด (All Card)เกินหนึ่งบัญชีกรณีฝ่าฝืนเปิดบัญชีออลการ์ด (All Card)มากกว่าหนึ่งบัญชีไม่ว่าจงใจหรือประมาทเลินเล่อก็ตามบัญชีที่ซ้อนนั้นไม่มีผลผูกพันบริษัทให้จำต้อง
                            ปฏิบัติตามแต่อย่างใดและท่านยินยอมให้บริษัทมีสิทธิในการบอกเลิกสัญญากับท่านได้ทันทีอีกทั้งหากมีความเสียหายเกิดขึ้นจากการกระทำดังกล่าวท่านยินยอมให้บริษัทเรียกร้องค่าเสียหายพร้อมดอกเบี้ยตามกฎหมายในอัตราร้อยละ 15 ต่อปีโดยท่านจะไม่หยิบยกข้อต่อสู้ใดๆ
                            ขึ้นเพื่อปฏิเสธความรับผิดชอบดังกล่าวด้วย{'\n'}
                            <Text>   </Text>2.4 หน้าที่ในการแจ้งการเปลี่ยนแปลงหรือยกเลิกไปรษณีย์อิเล็กทรอนิกส์ท่านจะต้องรีบแจ้งให้บริษัทรับทราบเป็นลายลักษณ์อักษรทางไปรษณีย์ลงทะเบียนหรือทางไปรษณีย์อิเล็กทรอนิกส์ (E-Mail) ทันทีที่มีการเปลี่ยนแปลงหรือยกเลิกที่อยู่ไปรษณีย์
                            อิเล็กทรอนิกส์ใดๆของท่านที่ได้ลงทะเบียนไว้กับบริษัทรวมทั้งท่านต้องให้จัดเตรียมที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ปัจจุบันของท่านได้ให้ไว้กับบริษัทหากบริษัทได้พยายามติดต่อกับท่านตามข้อมูลในการติดต่อที่ท่านให้ไว้แก่บริษัทในกรณีที่่ไม่สามารถติดต่อกับท่านได้บริษัทจะไม่
                            รับผิดชอบต่อไปรษณีย์อิเล็กทรอนิกส์ที่ไปไม่ถึงผู้รับหรือความเสียหายที่เกิดจากการไม่สามารถเข้าถึงบริการอินเตอร์เน็ตหรือไปรษณีย์อิเล็กทรอนิกส์ของท่านได้ในกรณีที่บริษัทตรวจพบว่าที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ที่ได้แจ้งไว้ของท่านมีการเปลี่ยนแปลงให้บริษัทมีสิทธิที่จะงด
                            ใช้ที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ที่ถูกเปลี่ยนแปลงและให้ใช้ที่อยู่ไปรษณีย์อิเล็กทรอนิกส์รองของท่านหรืออาจทำการประกาศหน้าเว็บไซต์สำหรับการติดต่อในการให้บริการเปลี่ยนแปลงข้อมูลส่วนตัวของท่านที่เกี่ยวข้องกับการแจ้งผ่านทางไปรษณีย์อิเล็กทรอนิกส์ไปที่ไปรษณีย์
                            อิเล็กทรอนิกส์ปกติของท่านโดยให้ถือว่าท่านทราบข้อมูลดังกล่าวแล้ว{'\n'}
                            <Text>   </Text>2.5 สิทธิในการแก้ไขเปลี่ยนแปลงเงื่อนไขการให้บริการท่านตกลงจะรับสื่ออิเล็กทรอนิกส์จากบริษัทในการแจ้งให้ทราบถึงการเปลี่ยนแปลงหรือการเพิ่มเติมของบริการหรือเพื่อวัตถุประสงค์อื่นใดตามที่บริษัทเห็นสมควรเช่นสัญญาการขอใช้บริการค่าธรรมเนียม
                            ข้อตกลงอื่นๆรวมทั้งประกาศต่างๆที่เกี่ยวข้องกับบัญชีออลการ์ด (All Card)ของท่านและ/หรือการใช้บริการออลการ์ด (All Card)ในการติดต่อสื่อสารทางอิเล็กทรอนิกส์การประกาศผ่านหน้าเว็บไซต์ออลการ์ด (All Card)และ/ หรือการสื่อสารผ่านทางไปรษณีย์อิเล็กทรอนิกส์ 
                            (E-Mail) ท่านสามารถพิมพ์ข้อความหรือเนื้อหาการสื่อสารเพื่อเก็บบันทึกไว้เป็นหลักฐานดังนั้นการสื่อสารทางอิเล็กทรอนิกส์ไม่ว่ากระทำผ่านสื่ออิเล็กทรอนิกส์หรือในรูปเอกสารใดๆจะถือว่าเป็นการสื่อสารที่เป็นลายลักษณ์อักษรและถือว่าท่านจะได้รับการสื่อสารดังกล่าวนับตั้งแต่วันที่
                            มีการประกาศหรือการส่งข้อความมายังท่านไม่ว่าท่านได้รับหรือเปิดดูข้อความหรือไม่ก็ตามบริษัทสงวนสิทธิที่จะไม่มีภาระผูกพันที่จะต้องสื่อสารในรูปแบบของเอกสารเว้นแต่ในกรณีที่มีการเปลี่ยนแปลงค่าธรรมเนียมบริษัทจะแจ้งให้ท่านทราบล่วงหน้าไม่น้อยกว่า 30 วันก่อนมีการเปลี่ยน
                            แปลงมีผลบังคับใช้โดยปิดประกาศทางเว็บไซต์หรือส่งไปรษณีย์อิเล็กทรอนิกส์ไปยังไปรษณีย์อิเล็กทรอนิกส์ของท่าน{'\n'}
                            <Text>   </Text>2.6 หน้าที่ในการผูกพันในธุรกรรมที่เสร็จสิ้นเป็นที่เรียบร้อยการทำธุรกรรมใดๆผ่านบริการออลการ์ด (All Card)ที่เสร็จสิ้นเป็นที่เรียบร้อยจะมีผลสมบูรณ์และผูกพันท่านทุกกรณีและท่านตกลงจะไม่ยกเหตุหรือข้อต่อสู้ใดๆขึ้นปฏิเสธความรับผิดชอบและ/ หรือ
                            การปฏิบัติตามสัญญานี้ต่อบริษัทในทุกกรณีทั้งสิ้นเว้นแต่กรณีที่ท่านได้แจ้งเหตุและ/หรือมีพฤติการณ์อันควรสงสัยเกี่ยวกับรายการดังกล่าวซึ่งท่านไม่ได้เป็นผู้ก่อขึ้นนั้นเพื่อขอระงับการใช้บริการและบริษัทรับทราบเรียบร้อยแล้ว{'\n'}
                            <Text>   </Text>2.7 หน้าที่ในการให้ใช้ความระมัดระวังในการตรวจสอบคุณภาพชนิดของสินค้าหรือบริการในการทำธุรกรรมซื้อขายสินค้าบริการหรือเกี่ยวกับประเภทธุรกิจใดๆนั้นท่านจะต้องใช้ความระมัดระวังอย่างดีเพื่อจะต้องตรวจสอบคุณภาพชนิดของสินค้าบริการตลอดจนความ
                            น่าเชื่อถือของผู้ขายสินค้า/ผู้ให้บริการด้วยในกรณีที่มีปัญหากับการใช้สินค้าและ/หรือบริการหรือความชำรุดบกพร่องหรือรอนสิทธิของสินค้าและ/หรือบริการความเสียหายใดๆทั้งทางตรงทางอ้อมโดยเฉพาะเจาะจงหรือเป็นผลสืบเนื่องจากการดำเนินการดังกล่าวข้างต้นท่านต้องดำเนินการ
                            ติดต่อกับผู้ขายหรือผู้ให้บริการของสินค้าและ/หรือบริการนั้นๆเองบริษัทไม่อาจรับประกันหรือรับผิดชอบต่อคุณภาพของสินค้าและ/หรือบริการหรือความเสียหายอันเกิดจากการจัดส่งหรือการจัดส่งที่ไม่ถูกต้องครบถ้วนหรือการกระทำใดๆที่ผิดข้อตกลงระหว่างผู้ส่งกับท่านเนื่องจากบริษัท
                            อำนวยความสะดวกในการให้บริการและ/หรือชำระค่าสินค้าหรือบริการและทำธุรกรรมตามคำสั่งของท่านเท่านั้นมิได้มีส่วนเกี่ยวข้องกับการจำหน่ายสินค้าและ/หรือบริการของร้านค้าแต่อย่างใด{'\n'}
                            <Text>   </Text>2.8 หน้าที่ในการห้ามทำธุรกรรมโดยมิชอบห้ามมิให้ท่านใช้ประโยชน์จากสัญญาหรือบริการออลการ์ด (All Card)นี้ในการทำธุรกรรมใดๆอันมีวัตถุประสงค์ต้องห้ามโดยกฎหมายหรือขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชนและท่านจะไม่กระทำการ
                            ใดๆไม่ว่าโดยจงใจหรือประมาทเลินเล่ออันเป็นเหตุให้เสียหายแก่ทรัพย์สินและ/หรือเป็นเหตุให้เสื่อมเสียแก่ชื่อเสียงหรือสิทธิอื่นใดๆของบริษัทและ/ หรือผู้ใช้บริการท่านอื่นหากท่านใช้สิทธิไปในทางที่ก่อให้เกิดความเสียหายดังกล่าวท่านตกลงที่จะรับผิดชอบต่อความเสียหายที่เกิดขึ้นเต็ม
                            จำนวนต่อบริษัทหรือบุคคลใดๆที่ได้รับความเสียหายจากเหตุดังกล่าว{'\n'}
                            <Text>   </Text>2.9 การละเมิดจากบุคคลภายนอกต่อการใช้บริการออลการ์ด (All Card)ท่านจะไม่เรียกร้องค่าเสียหายใดๆจากบริษัทหรือเจ้าหน้าที่ของบริษัทในกรณีที่มีความเสียหายใดๆอันเกิดจากการกระทำของบุคคลภายนอกที่มีผลต่อการใช้บริการออลการ์ด (All Card)ของท่าน
                            และไม่ว่าเกิดขึ้นจากระบบคอมพิวเตอร์ระบบอินเตอร์เน็ตอุปกรณ์อิเล็กทรอนิกส์ต่างๆหรือระบบอื่นใดที่เกี่ยวข้องกับการให้บริการนี้รวมทั้งระบบเครือข่ายโทรศัพท์เคลื่อนที่เป็นต้น{'\n'}
                            <Text>   </Text>2.10 หน้าที่ในการห้ามโอนสิทธิเรียกร้องหรือภาระผูกพันห้ามมิให้ท่านโอนสิทธิหน้าที่หรือภาระผูกพันใดๆตามสัญญานี้ให้แก่บุคคลอื่นเว้นแต่ได้รับความยินยอมที่เป็นลายลักษณ์อักษรเป็นการล่วงหน้าจากบริษัท{'\n'}
                            <Text>   </Text>2.11 หน้าที่ในการห้ามทำการเชื่อมโยงเว็บไซต์ (Framing) ห้ามท่านเชื่อมโยงเว็บไซต์(Framing) เพื่อเข้าสู่บริการออลการ์ด (All Card)การเชื่อมโยงเว็บไซต์ (Framing) หรือการที่เว็บไซต์ของบุคคลภายนอกแสดงส่วนหนึ่งส่วนใดของเว็บไซต์ออลการ์ด (All Card)
                            ภายในหน้าเว็บเพจที่ไม่ได้ขึ้นต้นด้วยhttps://www.allcard.app ในกรณีที่ฝ่าฝืนกระทำการดังกล่าวและก่อให้เกิดความเสียหายท่านจะต้องรับผิดต่อบริษัทหรือบุคคลอื่นใดที่เกี่ยวข้องบริษัทจะไม่รับผิดชอบต่อความเสียหายใดๆอันเนื่องมาจากการเชื่อมโยงกับเว็บไซต์ (Framing) หรือการใดๆที่มี
                            ลักษณะอย่างเดียวกับการกระทำดังกล่าว{'\n'}
                            <Text>   </Text>2.12 หน้าที่ในการห้ามกระทำความผิดต่อข้อมูลคอมพิวเตอร์หรือระบบคอมพิวเตอร์ในกรณีที่ท่านหรือบัญชีของท่านมีพฤติการณ์หรือมีความพยายามที่จะใช้บริการออลการ์ด (All Card)เพื่อวัตถุประสงค์อื่นที่ไม่ใช่เพื่อการชำระเงินหรือการจัดการบัญชีของท่านรวมถึงเข้าถึงข้อมูล
                            ทำให้เสียหายทำลายแก้ไขเปลี่ยนแปลงข้อมูลคอมพิวเตอร์หรือระบบคอมพิวเตอร์หรือมาตรการป้องกันโดยมิชอบบริษัทมีสิทธิที่จะยกเลิกบัญชีของท่านในทันทีและท่านต้องรับผิดชอบต่อความเสียหายจากการกระทำที่เกิดจากการกระทำโดยจงใจหรือประมาทเลินเล่ออันเป็นเหตุให้เสียหายจากการกระทำ
                            ดังกล่าวรวมถึงท่านอาจถูกฟ้องร้องดำเนินคดีทั้งทางแพ่งและทางอาญาตามกฎหมายต่อไปด้วย{'\n\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 3 เงื่อนไขการใช้บริการออลการ์ด (All Card)</Text>{'\n\n'}
                            <Text>   </Text>3.1 การสมัครขอใช้บริการการสมัครขอใช้บริการคลิก “สมัครสมาชิก” หรือ “Register” แล้วระบุที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) สำหรับใช้เป็นบัญชี (Account/Username) ในการเข้าสู่ระบบออลการ์ด (All Card)พร้อมข้อมูลต่างๆตามที่ระบุโดยออลการ์ด 
                            (All Card)จะแจ้งยืนยันที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) ที่ท่านให้ไว้เมื่อท่านคลิกลิงค์ในไปรษณีย์อิเล็กทรอนิกส์ (E-Mail) นั้นจะนำท่านเข้าสู่ระบบออลการ์ด (All Card)เพื่อให้ท่านบันทึกและยืนยันหมายเลขโทรศัพท์มือถือของท่านซึ่งจะเป็นช่องทางรับรหัส OTP (One Time Password) 
                            มากำกับรายการชำระเงินของท่าน{'\n'}
                            <Text>   </Text>3.2 รหัสผ่าน (Password){'\n'}
                            <Text>      </Text>• 3.2.1 ท่านสามารถเปลี่ยนรหัสผ่าน (Password) ได้ด้วยตนเองผ่านระบบออนไลน์ (Online)ที่ออลการ์ด (All Card)ให้บริการได้{'\n'}
                            <Text>      </Text>• 3.2.2 กรณีที่ท่านลืมรหัสผ่าน (Password) ที่ใช้ปัจจุบันท่านต้องตอบคำถามเฉพาะที่ท่านเคยเลือกเมื่อสมัครใช้บริการหรือเลขบัตรประชาชนให้ถูกต้องก่อนแล้วระบบจะออกรหัสผ่าน (Password)ใหมส่งไปยังที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) ที่ท่านได้ทะเบียนไว้
                            กับออลการ์ด (All Card)ทั้งนี้ท่านต้องเปลี่ยนรหัสผ่าน (Password) เองทันทีเมื่อเข้าสู่ระบบได้{'\n'}
                            <Text>      </Text>• 3.2.3 กรณีที่ท่านป้อนรหัสผ่าน (Password) ผิด 3 ครั้งติดต่อกันท่านจะถูกระงับการใช้บริการโดยอัตโนมัติทันทีท่านจะสามารถใช้บริการนี้ต่อไปได้ก็ต่อเมื่อแจ้งความจำนงให้บริษัทดำเนินการตามวิธีอื่นใดที่บริษัทกำหนดเพื่อขอออกรหัสผ่าน (Password) ใหม่ทั้งนี้ท่านต้องเปลี่ยน
                            รหัสผ่าน (Password) เองทันทีเมื่อเข้าสู่ระบบได้{'\n'}
                            <Text>   </Text>3.3 สถานะบัญชีเมื่อท่านเข้าสู่ระบบออลการ์ด (All Card)แล้วระบบจะแสดงชื่อหมายเลขสมาชิกสถานะบัญชียอดเงินคงเหลือทั้งหมดในบัญชีและรูปของสมาชิก(ถ้ามี){'\n'}
                            <Text>   </Text>3.4 ข้อมูลส่วนตัวสามารถตรวจสอบหรือเปลี่ยนแปลงข้อมูลส่วนตัวของท่านเพิ่มเติมได้เช่นที่อยู่วันเดือนปีเกิดที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) หมายเลขโทรศัพท์เป็นต้นโดยคลิก “ข้อมูลส่วนตัว” และเลือกแก้ไขข้อมูลที่ต้องการแล้วป้อนรหัสส่วนบุคคล (PIN) ของท่านเพื่อ
                            ยืนยันรายการ{'\n'}
                            <Text>   </Text>3.5 การเติมเงินการเติมเงินเข้าบัญชีออลการ์ด (All Card)คลิก “เติมเงิน” เพื่อเลือกช่องทางเติมเงินเข้าบัญชีออลการ์ด (All Card)ดังนี้{'\n'}
                            <Text>      </Text>• 3.5.1 ท่านสามารถเติมเงินเข้าบัญชีออลการ์ด (All Card)จากบัตรวีซ่าและ/หรือบัตรมาสเตอร์การ์ดโดยไม่เสียค่าธรรมเนียมใดๆท่านสามารถใช้วงเงินอนุมัติคงเหลือบางส่วนหรือทั้งหมดของบัตรบัตรวีซ่าและ/หรือบัตรมาสเตอร์การ์ดของท่านเติมเงินเข้าบัญชีออลการ์ด (All Card){'\n'}
                            <Text>      </Text>• 3.5.2 ท่านสามารถเติมเงินเข้าบัญชีออลการ์ด (All Card)จากการหักเงินในบัญชีธนาคารของท่านโดยไม่เสียค่าธรรมเนียมใดๆให้แก่ธนาคารเจ้าของบัญชีนั้นๆหากเป็นไปตามเงื่อนไขจำนวนเงินขั้นต่ำที่บริษัทกำหนดซึ่งท่านสามารถตรวจสอบ “ค่าธรรมเนียม” ได้บนเว็บไซต์เงินที่เติมจะโอน
                            เข้าบัญชีออลการ์ด (All Card)ของท่านต่อเมื่อรายการเติมเงินตามช่องทางดังกล่าวมีผลเสร็จสมบูรณ์จะมีการแสดงผลการเติมเงินผ่านหน้าจอและส่งไปรษณีย์อิเล็กทรอนิกส์ (E-Mail) แจ้งรายละเอียดการเติมเงินไปยังที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) หลักของท่าน{'\n'}
                            <Text>   </Text>3.6 วิธีการซื้อสินค้าหรือบริการการซื้อสินค้าและ/หรือบริการจากร้านค้าออนไลน์ที่เชื่อมต่อกับออลการ์ด (All Card)ท่านสามารถทำได้ทุกเวลาโดยคลิกเมนู “E-Commerce” เพื่อเข้าสู่หน้าที่แสดงไอคอนร้านค้าในการชำระเงินค่าสินค้าและ/หรือบริการระบบจะให้ท่านกรอกรหัส PIN หรือ รหัส OTP 
                            (One Time Password) ซึ่งระบบจะส่งไปที่โทรศัพท์มือถือของท่านสำหรับกำกับยืนยันรายการดังกล่าวทั้งนี้เพื่อลดความเสี่ยงในการแอบอ้างทำรายการ{'\n'}
                            <Text>   </Text>3.7 ค่าธรรมเนียมท่านสามารถตรวจสอบค่าธรรมเนียมที่จะเรียกเก็บจากผู้ใช้บริการในหน้าเว็บไซต์ภายใต้หัวข้อ “ค่าธรรมเนียม” หรือ “Fee” หากมีการเปลี่ยนแปลงค่าธรรมเนียมบริษัทจะประกาศบนเว็บไซต์https://allcard.appช่องทางการให้บริการและ/หรือแจ้งไปยังที่อยู่ไปรษณีย์อิเล็กทรอนิกส์
                            ของท่านให้ทราบล่วงหน้าไม่น้อยกว่า 30 วันก่อนการเปลี่ยนแปลงจะมีผลใช้บังคับ{'\n'}
                            <Text>   </Text>3.8 ประวัติธุรกรรมท่านสามารถตรวจสอบประวัติการทำรายการต่างๆเช่นการเติมเงินการซื้อสินค้าและ/หรือบริการของท่านได้โดยคลิก “ประวัติ” หรือ “History” โดยระบุช่วงเวลา/ประเภทรายการที่ต้องการ{'\n'}
                            <Text>   </Text>3.9 การร้องเรียน / ข้อโต้แย้งและแจ้งข้อมูลการร้องเรียนหรือข้อโต้แย้งรวมทั้งแจ้งข้อมูลข่าวสารปัญหาต่างๆที่พบเกี่ยวกับการใช้บริการออลการ์ด (All Card)ท่านสามารถแจ้งบริษัทได้ที่หน้า “ติดต่อเรา” หรือ “Contact Us” ผ่านช่องทางดังนี้{'\n'}
                            <Text>      </Text>• ช่องทางที่ 1ส่งไปรษณีย์อิเล็กทรอนิกส์มาที่hello@allcard.app หรือhello@allcardwallet.com{'\n'}
                            <Text>      </Text>• ช่องทางที่ 2 Call Center ตามหมายเลขโทรศัพท์และโทรสารที่ปรากฏบนเว็บไซต์โดยบริษัทจะนำข้อมูลต่างๆที่ท่านแจ้งไว้มาทำการตรวจสอบข้อมูลเพื่อหาสาเหตุของที่เกิดขึ้นและทำการแก้ไขทันทีกรณีที่ปัญหานั้นส่งผลกระทบกับสมาชิกโดยรวมบริษัทแจ้งให้สมาชิกทุกรายทราบผ่านหน้าเว็บไซต์
                            https://allcard.appและช่องทางการให้บริการอย่างชัดเจนก่อนการทำการแก้ไขหรือเปลี่ยนแปลงข้อมูลใดๆกรณีที่ข้อร้องเรียนหรือข้อโต้แย้งเกี่ยวกับมูลค่าเงินในบัญชีออลการ์ด (All Card)เช่นมีรายการใดที่ท่านไม่ได้ทำหรือรายการที่ท่านทำยังไม่ปรากฏในหน้า “ประวัติธุรกรรม” ท่านต้องรีบแจ้งทันทีโดยระบุข้อมูลดังต่อไปนี้{'\n'}
                            <Text>         </Text>•	1. ชื่อและที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (E-Mail Address) หลักของท่าน{'\n'}
                            <Text>         </Text>•	2. รายการต้องสงสัยพร้อมทั้งอธิบายถึงรายละเอียดความผิดพลาดหรือความไม่ถูกต้องของรายการ{'\n'}
                            <Text>         </Text>•	3. จำนวนเงินในรายการต้องสงสัย{'\n'}
                            สำหรับกรณีที่เกี่ยวกับมูลค่าเงินในบัญชีออลการ์ด (All Card)บริษัทจะทำการตรวจสอบเป็นครั้งๆไปและทันทีที่ได้รับแจ้งข้อร้องเรียนจากท่านโดยท่านยินยอมให้บริษัทระงับการใช้บริการออลการ์ด (All Card)ทุกอย่างของบัญชีของท่านชั่วคราวจนกว่าได้รับผลการตรวจสอบออกมาอย่างแน่นอนในการนี้บริษัทจะดำเนินการตรวจสอบ
                            และแจ้งความคืบหน้ารวมทั้งชี้แจงขั้นตอนต่อไปให้ท่านทราบภายใน 7 วันนับจากวันที่ได้รับแจ้งข้อร้องเรียนและหากตรวจพบว่าเหตุเกิดมาจากความผิดของบริษัทบริษัทจะทำการแก้ไขที่ระบบให้สามารถใช้งานได้สมบูรณ์เป็นข้อมูลและยอดเงินที่ถูกต้องแต่ถ้าเป็นความผิดที่เกิดจากตัวท่านเองท่านจะต้องเป็นผู้รับผิดชอบความเสียหาย
                            ที่เกิดขึ้นทั้งหมดเพียงผู้เดียว{'\n'}
                            <Text>   </Text>3.10 วิธีการยกเลิกการใช้บริการหรือขอปิดบัญชีออลการ์ด (All Card)การยกเลิกการใช้บริการหรือการขอปิดบัญชีออลการ์ด (All Card)ท่านสามารถขอแบบฟอร์มการขอปิดบริการที่หน้าเว็บไซต์ออลการ์ด (All Card)เพื่อระบุรายละเอียดการร้องขอปิดบริการพร้อมแนบสำเนาบัตรประชาชนหรือเอกสารราชการ
                            อื่นใดที่ยืนยันว่าเป็นของเจ้าของบัญชีโดยลงลายมือชื่อรับรองสำเนาถูกต้องแล้วส่งเรื่องโดยตรงมายัง hello@allcard.appซึ่งเจ้าหน้าที่ของบริษัทจะตรวจสอบสถานะความเป็นเจ้าของบัญชีและยอดเงินคงเหลือของท่านรวมทั้งผลการเรียกเก็บของการเติมเงินผ่านบัตรเครดิตของท่าน (ถ้ามี) ทั้งนี้การปิดบัญชีออลการ์ด (All Card)ของ
                            ท่านมีผลตั้งแต่วันที่ที่ท่านติดต่อขอปิดบัญชีสำหรับกรณีที่ไม่ต้องรอผลการเรียกเก็บของการเติมเงินผ่านบัตรเครดิตของท่านบริษัทจะโอนยอดเงินคงเหลือในบัญชีออลการ์ด (All Card)ของท่านหลังหักค่าธรรมเนียมใดๆ (ถ้ามี) และ/หรือเงินที่ท่านค้างชำระกับบริษัท (ถ้ามี) เพื่อเข้าบัญชีธนาคารที่ท่านแจ้งไว้ภายใน 15 วันในกรณีมี
                            เหตุฉุกเฉินเหตุสุดวิสัยหรือมีพฤติการณ์อันใดอันหนึ่งซึ่งเป็นการพ้นวิสัยอื่นใดบริษัทสงวนสิทธิ์ที่จะทำการตรวจสอบสถานะความเป็นเจ้าของบัญชีและยอดเงินคงเหลือของท่านรวมทั้งรายการที่ค้างชำระและโอนยอดเงินคืนเป็นระยะเวลาเกินกว่า 15 วันเพื่อให้การโอนเงินเข้าบัญชีเป็นไปโดยถูกต้องตามกฎหมายในกรณีที่บัญชีออลการ์ด 
                            (All Card)ของท่านไม่มีการเคลื่อนไหวทางบัญชีเป็นระยะเวลาเกินกว่า6 เดือนบริษัทมีสิทธินำยอดเงินคงเหลือที่อยู่ในบัญชีดังกล่าวมาหักเป็นค่าธรรมเนียมในการรักษาบัญชีเป็นจำนวน 50 บาทโดยจะหักค่าธรรมเนียมในการรักษาบัญชีทุกเดือนในกรณีที่ท่านแจ้งความประสงค์ขอปิดบัญชีออลการ์ด (All Card)แต่ยอดเงินคงเหลือ
                            ของท่านมีจำนวนน้อยกว่าค่าธรรมเนียมธนาคารหรือค่าธรรมเนียมอื่นๆหรือในกรณีที่ยอดเงินคงเหลือในบัญชีออลการ์ด (All Card)ของท่านนั้นมียอดคงเหลือน้อยกว่าค่าธรรมเนียมและบัญชีออลการ์ด (All Card)ของท่านไม่มีการเคลื่อนไหวทางบัญชีเป็นระยะเวลาเกินกว่า 6 เดือนบริษัทมีสิทธิที่จะปิดบัญชีออลการ์ด (All Card)
                            ของท่านและนำจำนวนเงินที่คงเหลือในบัญชีออลการ์ด (All Card)มาหักเป็นค่าธรรมเนียมในการปิดบัญชี{'\n'}
                            <Text>   </Text>3.11 การยอมรับเงื่อนไขและข้อกำหนดท่านยอมรับเงื่อนไขและค่าธรรมเนียมรวมทั้งข้อกำหนดต่างๆในการใช้บริการออลการ์ด (All Card)ซึ่งท่านสามารถศึกษาวิธีการใช้งานและรายละเอียดเกี่ยวกับค่าธรรมเนียมได้ในหน้าเว็บไซต์ https://www.allcard.app{'\n'}
                            <Text>   </Text>3.12 ห้ามทำธุรกรรมเบิกเงินล่วงหน้าห้ามมิให้ท่านทำธุรกรรมหรือมีส่วนร่วมในการกระทำอันมีวัตถุประสงค์เพื่อเป็นการเบิกเงินล่วงหน้าจากบัตรเครดิต{'\n'}
                            <Text>   </Text>3.13 ห้ามถอนเงินจากบัญชีออลการ์ด (All Card)เงินที่เติมจากทุกช่องทางจะไม่สามารถถอนจากบัญชีออลการ์ด (All Card)ได้{'\n\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 4 สิทธิหน้าที่/ภาระผูกพันและข้อสงวนสิทธิของบริษัท</Text>{'\n\n'}
                            <Text>   </Text>4.1 สิทธิในการพิจารณาไม่ให้บริการบริษัทมีสิทธิที่จะยกเลิกไม่ให้บริการแก่ท่านและ/หรือไม่ผูกพันบริษัทให้ต้องทำสัญญานี้กับท่านและให้ถือว่าเป็นสิทธิในการตัดสินของบริษัทโดยเด็ดขาดบริษัทไม่ต้องรับผิดชอบในความเสียหายหรือค่าใช้จ่ายใดๆอันอาจเกิดขึ้นจากการขอใช้บริการ{'\n'}
                            <Text>   </Text>4.2 สิทธิการหักเงินชำระหนี้บริษัทสามารถใช้สิทธิหักเงินจากบัญชีของท่านได้ในจำนวนเท่ากับที่บริษัทชำระให้แก่ธนาคารหรือเท่ากับจำนวนเงินที่ธนาคารหักเงินคืนจากบัญชีเงินฝากที่บริษัทมีอยู่กับธนาคารในกรณีที่ธนาคารปฏิเสธการอนุมัติวงเงินบัตรเครดิตก็ดีปฏิเสธการจ่ายเงินก็ดีหรือไม่สามารถเรียกเก็บเงินได้ไม่
                            ว่าจะด้วยสาเหตุใดและหากเงินในบัญชีของท่านไม่เพียงพอที่จะชำระคืนเงินดังกล่าวได้ทั้งหมดท่านจะต้องทำการชำระเงินหรือโอนเงินส่วนที่เหลือคืนให้แก่บริษัทโดยทันทีตามที่บริษัทแจ้งให้ทราบ{'\n'}
                            <Text>   </Text>4.3 สิทธิในการเปิดเผยข้อมูลของท่านท่านยินยอมให้บริษัทเปิดเผยข้อมูลเกี่ยวกับท่านซึ่งได้ให้ไว้แก่บริษัทต่อบุคคลที่เกี่ยวข้องกับการดำเนินการใดๆภายใต้สัญญาฉบับนี้โดยบริษัทไม่จำต้องขอความยินยอมใดๆจากท่านและท่านตกลงจะไม่เรียกร้องค่าเสียหายใดๆจากบริษัททั้งสิ้น{'\n'}
                            <Text>   </Text>4.4 สิทธิในการปิดบัญชีจำกัดการใช้บริการระงับการใช้บริการในกรณีที่ปรากฏว่าท่านฝ่าฝืนข้อหนึ่งข้อใดตามข้อกำหนดแห่งสัญญาก็ดีหรือโดยสาเหตุอื่นใดก็ดีทั้งนี้ไม่ว่ากรณีใดๆเช่นเป็นรายการต้องสงสัยหรือบุคคลหรือนิติบุคคลองค์กรหน่วยงานต่างๆที่เกี่ยวข้องแจ้งขอความร่วมมือให้ดำเนินการระงับการทำรายการมา
                            ยังบริษัทไม่ว่าท่านจะมีเงินค้างในบัญชีหรือจะยินยอมด้วยหรือไม่ก็ตามบริษัทมีสิทธิในการปิดบัญชีจำกัดการใช้บริการระงับการให้บริการและ/ หรือบอกเลิกสัญญากับท่านได้ทันทีโดยมิต้องแจ้งให้ทราบล่วงหน้าและท่านตกลงไม่เรียกร้องค่าเสียหายใดๆโดยบริษัทจะพิจารณาตามพฤติกรรมอันควรแต่ละกรณีไปอีกทั้งบริษัทขอสงวนสิทธิในการ
                            ตรวจสอบประวัติด้านข้อมูลเครดิตของบัญชีของท่านและบริษัทสามารถใช้ดุลพินิจในการพิจารณาปิดบัญชีใดๆหรือจำกัดการให้บริการโดยอาศัยข้อมูลที่ได้จากการตรวจสอบด้านเครดิตของท่านบริษัทจะแจ้งให้ท่านทราบทางไปรษณีย์อิเล็กทรอนิกส์ (E-Mail) หากบัญชีของท่านถูกจำกัดการใช้บริการหรือกรณีที่บริษัทต้องการขอข้อมูลเพื่อ
                            แก้ไขปัญหาจากท่านและเมื่อบริษัทตรวจสอบแล้วพบว่าบัญชีของท่านไม่ได้กระทำความผิดตามสัญญาหรือกฎหมายในการใช้บริการของบริษัทบริษัทจะดำเนินการยกเลิกการจำกัดการใช้บริการของท่านอย่างไรก็ตามบริษัทอาจจำกัดการใช้บริการของท่านถึง 180 วันเพื่อให้ท่านดำเนินการแก้ปัญหาและหากบริษัทพบว่าท่านมีพฤติกรรมที่เสี่ยง
                            ต่อการก่อให้เกิดความเสียหายต่อบริการออลการ์ด (All Card)หรือต่อผู้ใช้บริการออลการ์ด (All Card)ท่านอื่นบริษัทจะทำการปิดบัญชีออลการ์ด (All Card)ของท่านและระงับการให้บริการใดๆและ/หรือดำเนินการตามที่บริษัทเห็นสมควรกรณีที่ท่านกระทำหรือมีส่วนร่วมในการกระทำความผิดต่อกฏหมายโดยใช้บริการออลการ์ด 
                            (All Card)เป็นเครื่องมือในการกระทำความผิดหรือใช้/ แจ้งข้อมูลอันเป็นเท็จต่อบริษัทหรือท่านละเมิดเงื่อนไขหรือข้อกำหนดในสัญญานี้ข้อหนึ่งข้อก็ดีและบริษัทพิจารณาแล้วว่าเป็นการผิดสัญญากันในสาระสำคัญบริษัทจะยกเลิกการให้บริการและปิดบัญชีออลการ์ด (All Card)ของท่านทันทีโดยท่านตกลงจะไม่ดำเนินการใดๆทั้งสิ้นกับ
                            บริษัทเพื่อเรียกร้องเงินที่คงค้างอยู่ในบัญชีออลการ์ด (All Card)ของท่านซึ่งบริษัทจะคืนเงินให้แก่ผู้ที่สามารถนำหลักฐานที่น่าเชื่อถือมาแสดงการเป็นผู้มีสิทธิรับเงินหรือตามคำสั่งจากหน่วยงานราชการที่เกี่ยวข้องทั้งนี้บริษัทขอสงวนสิทธิที่จะหักค่าธรรมเนียมหรือค่าใช้จ่ายใดๆจากการดูแลรักษาเงินดังกล่าวและเงินที่ค้างชำระกับบริษัท (ถ้ามี) 
                            จากจำนวนเงินทั้งหมดก่อนส่งคืนแก่ผู้มีสิทธิรับเงินภายใน 30 วันนับจากวันที่ได้พิสูจน์สิทธิในเงินที่อายัดนั้น{'\n'}
                            <Text>   </Text>4.5 สิทธิในทรัพย์สินทางปัญญาบริษัทขอสงวนสิทธิในเครื่องหมายการค้าAll Card (ออลการ์ด) https://www.allcard.app HTMLและ logo อื่นๆหรือบริการที่ระบุภายในเว็บไซต์ที่เป็นเครื่องหมายการค้าหรือสิทธิในทรัพย์สินทางปัญญาอื่นใดของออลการ์ด (All Card)บริษัทไม่อนุญาตให้ทำซ้ำแก้ไขเปลี่ยน
                            แปลงส่วนใดส่วนหนึ่งดัดแปลงลอกเลียนเผยแพร่หรือใช้ส่วนหนึ่งส่วนใดหรือทำการละเมิดในลักษณะอื่นใดต่อเครื่องหมายการค้าหรือสิทธิในทรัพย์สินทางปัญญาอื่นใดของบริษัทโดยไม่ได้รับอนุญาต{'\n'}
                            <Text>   </Text>4.6 สิทธิในการสืบค้นข้อมูลของผู้สมัครใช้บริการในการค้นหาข้อมูลที่เห็นว่าจำเป็นในการตรวจสอบความถูกต้องของข้อมูลลงทะเบียนของท่านท่านให้สิทธิบริษัทหรือตัวแทนการสืบค้นข้อมูลอาจรวมถึงการตรวจสอบข้อมูลเครดิตหรือข้อมูลอื่นๆที่เกี่ยวข้องจากฐานข้อมูลของบุคคลที่สามได้{'\n'}
                            <Text>   </Text>4.7 สิทธิยึดหน่วงและหักกลบลบหนี้ในกรณีที่บริษัทรับโอนสิทธิตามสัญญาหรือรับช่วงสิทธิตามกฎหมายในการชดใช้ค่าชดใช้ค่าเสียหายของบริษัทเพื่อให้เป็นไปตามสัญญานี้บริษัทสามารถดำเนินการใช้สิทธิยึดถือในเงินที่อยู่ในบัญชีของท่านและบริษัทอาจนำเงินของท่านที่อยู่ในบัญชีออลการ์ด (All Card)ไปเพื่อชำระหนี้
                            ที่ท่านค้างชำระต่อบริษัทหรือต่อบุคคลอื่นตามกฎหมาย{'\n'}
                            <Text>   </Text>4.8 สิทธิในการยกเลิกเพิกถอนการเปลี่ยนแปลงแก้ไขข้อความในสัญญาบริษัทมีสิทธิยกเลิกเพิกถอนและ / หรือเปลี่ยนแปลงแก้ไขข้อความในสัญญาฉบับนี้ไม่ว่าทั้งหมดหรือบางส่วนได้โดยต้องแจ้งให้ทราบด้วยวิธีการส่งจดหมายอิเล็กทรอนิกส์หรือปิดประกาศทางเว็บไซต์โดยให้มีผลในทันทีโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                            แต่อย่างใดและท่านตกลงที่จะไม่เรียกร้องค่าเสียหายใดๆจากบริษัทในกรณีมีการเปลี่ยนแปลงข้อกำหนด/เงื่อนไข/ข้อบังคับตามสัญญานี้ท่านยินยอมปฏิบัติตามเงื่อนไขข้อบังคับที่เปลี่ยนแปลงนั้นด้วยโดยมีผลบังคับใช้ในทันทีซึ่งบริษัทจะประกาศแจ้งให้ทราบทางเว็บไซต์หรือแจ้งให้ทราบทางไปรษณีย์อิเล็กทรอนิกส์ (E-Mail) เว้นแต่ในกรณีที่มี
                            การเปลี่ยนแปลงค่าธรรมเนียมบริษัทจะแจ้งให้ท่านทราบล่วงหน้าไม่น้อยกว่า 30 วันก่อนการเปลี่ยนแปลงมีผลใช้บังคับโดยบริษัทจะประกาศบนเว็บไซต์ https://www.allcard.app ช่องทางการให้บริการและ/หรือแจ้งไปยังไปรษณีย์อิเล็กทรอนิกส์ของท่านหากท่านไม่ปฏิบัติตามเงื่อนไขแห่งสัญญานี้ไม่ว่าข้อหนึ่งข้อใดก็ตามบริษัทมีสิทธิแจ้งการ
                            บอกเลิกสัญญาผ่านทางระบบคอมพิวเตอร์หรือไปรษณีย์อิเล็กทรอนิกส์ไปยังท่านได้ทันที{'\n'}
                            <Text>   </Text>4.9 สิทธิในดอกผลหรือผลประโยชน์อื่นใดบริษัทจะรวมเงินทุนของท่านกับเงินทุนของผู้ใช้บริการท่านอื่นๆไว้ในบัญชีธนาคาร (บัญชีรวม) ที่บริษัทเป็นเจ้าของโดยแยกต่างหากจากเงินทุนที่บริษัทใช้ในการดำเนินการและจะไม่นำไปใช้ในวัตถุประสงค์อื่นของบริษัทในกรณีที่มีดอกผลหรือผลประโยชน์อื่นใดที่เกิดขึ้นในบัญชี
                            รวมในขณะที่บริษัททำหน้าที่เก็บรักษาเงินทุนนั้นท่านได้ยินยอมและยอมรับให้ดอกผลหรือผลประโยชน์ดังกล่าวตกเป็นสิทธิของบริษัทโดยท่านตกลงจะไม่รับดอกผลหรือผลประโยชน์ใดๆที่เกิดขึ้น{'\n'}
                            <Text>   </Text>4.10 สิทธิในการดำเนินการทางกฎหมายแทนท่านในกรณีที่มีความจำเป็นบริษัทมีสิทธิจะกระทำกิจใดๆในทางติดตามทวงถามเรียกทรัพย์สินคืนยื่นฟ้องมอบข้อพิพาทให้อนุญาโตตุลาการพิจารณาหรือร้องทุกข์ดำเนินคดีใดๆหรือดำเนินการทางกฎหมายอื่นใดแทนท่านได้ทั้งทางแพ่งและทางอาญาโดยไม่ถือว่าเป็นการกระทำโดย
                            ปราศจากอำนาจหรือนอกเหนือขอบอำนาจ{'\n'}
                            <Text>   </Text>4.11 ข้อสงวนสิทธิจำกัดหรือยกเว้นความรับผิดอื่นๆ{'\n'}
                            <Text>      </Text>• 4.11.1 การแจ้งข้อมูลหรือข้อความอันเป็นเท็จบริษัทจะไม่รับผิดชอบต่อความเสียหายใดๆที่เกิดจากการแสดงข้อความอันเป็นเท็จปกปิดข้อความจริงหรือโดยวิธีใดๆที่แสดงถึงพฤติการณ์อันเป็นการปกปิดข้อมูลของตัวผู้ใช้บริการ{'\n'}
                            <Text>      </Text>• 4.11.2 ความล่าช้าในการทำธุรกรรมบริษัทจะดำเนินการหักเงินจาก/ฝากเงินเข้าบัญชีธนาคารบัตรเครดิตตามคำขอของท่านที่กระทำผ่านสื่ออิเล็กทรอนิกส์โดยบริษัทจะดำเนินการดังกล่าวในทันทีบริษัทจะไม่รับผิดชอบต่อความเสียหายใดๆทั้งสิ้นจากความล่าช้ามิได้มีสาเหตุมาจากพฤติการณ์อันเป็นการพ้นวิสัยซึ่งบริษัทไม่
                            ต้องรับผิดชอบหรือจากเหตุสุดวิสัยอื่นใดอันส่งผลให้เกิดความล่าช้าในการทำธุรกรรม{'\n'}
                            <Text>      </Text>• 4.11.3 การชำระหนี้ไม่ถูกต้องระหว่างร้านค้ากับท่านบริษัทจะไม่รับผิดชอบในความเสียหายอันเกิดจากการจัดส่งสินค้าหรือบริการหรือการจัดส่งที่ไม่ถูกต้องครบถ้วนหรือการกระทำใดๆที่ผิดข้อตกลงระหว่างผู้ส่งกับผู้รับเป็นเรื่องที่ท่านต้องไปว่ากล่าวกันเองระหว่างร้านค้ากับท่าน{'\n'}
                            <Text>      </Text>• 4.11.4 ข้อจำกัดความรับผิดในเรื่องละเมิดกรณีที่มีพฤติการณ์อันใดอันหนึ่งอันเป็นการพ้นวิสัยซึ่งบริษัทไม่ต้องรับผิดชอบจากการกระทำโดยจงใจหรือโดยประมาทเลินเล่อในการทำหน้าที่ของบุคคลภายนอกเช่นผู้ให้บริการโทรคมนาคมผู้ให้บริการระบบคอมพิวเตอร์หรือเหตุสุดวิสัยหรือพ้นวิสัยอื่นใดๆบริษัทจะไม่รับผิดชอบต่อ
                            ความเสียหายที่เป็นผลสืบเนื่องมาจากและในกรณีที่บริษัทได้แจ้งเตือนท่านแล้วถึงความเสียหายที่อาจเกิดขึ้นบริษัทไม่ต้องรับผิดชอบต่อความเสียหายที่เกิดจากการกระทำของบุคคลอื่นอันเป็นการละเมิดหรือก่อความเสียหายใดๆต่อท่านบริษัทไม่ต้องรับผิดชอบต่อเนื้อหาใดๆที่แสดงบนเว็บไซต์อื่นที่มีการเชื่อมโยงถึงบริษัทหรือต่อความเสียหายใดๆที่เกิดขึ้น
                            จากการเข้าชมเว็บไซต์เหล่านั้นบริษัทจะไม่รับผิดชอบต่อความเสียหายใดๆทั้งสิ้นเว้นแต่เป็นการกระทำโดยกลฉ้อฉลหรือประมาทเลินเล่ออย่างร้ายแรงของบริษัทเพื่อแสวงหาผลประโยชน์โดยมิชอบด้วยกฎหมาย{'\n'}
                            <Text>      </Text>• 4.11.5 การสละสิทธิของบริษัทการที่บริษัทยอมสละสิทธิหรือข้อปฏิบัติใดๆให้แก่ท่านบางส่วนหรือทั้งหมดครั้งเดียวหรือหลายครั้งก็ตามไม่มีผลที่จะให้ถือว่าบริษัทได้สละเจตนาของสัญญานี้บางส่วนหรือบางข้อในครั้งต่อๆไป{'\n'}
                            <Text>      </Text>• 4.11.6 ค่าใช้จ่ายในการติดตามทวงทรัพย์สินหรือสินค้าจากบุคคลภายนอกกรณีมีเหตุให้ต้องติดตามทวงคืนทรัพย์สินหรือสินค้าจากบุคคลภายนอกบริษัทสงวนสิทธิที่จะไม่รับผิดชอบต่อความเสียหายดังกล่าวท่านจะต้องดำเนินการด้วยค่าใช้จ่ายของท่านเอง{'\n'}
                            <Text>      </Text>• 4.11.7 ความไม่สมบูรณ์บางส่วนของสัญญาหากสัญญานี้ข้อหนึ่งข้อใดเป็นโมฆะหรือไม่สมบูรณ์คู่สัญญาตกลงให้ถือว่าส่วนที่ไม่เป็นโมฆะหรือสมบูรณ์แยกออกจากส่วนที่เป็นโมฆะหรือไม่สมบูรณ์นั้นและมีผลบังคับได้{'\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 5 การสิ้นสุดของสัญญา</Text>{'\n\n'}
                            <Text>   </Text>5.1 เงื่อนไขในการเลิกสัญญา{'\n'}
                            <Text>      </Text>• 5.1.1 การเลิกสัญญาโดยความยินยอมทั้งสองฝ่ายในกรณีที่คู่สัญญาทั้งสองฝ่ายแสดงเจตนาในการยินยอมให้สัญญาเลิกกันให้สัญญามีผลสิ้นสุดลงทันทีนับแต่วันที่ได้มีการแสดงเจตนาเป็นลายลักษณ์อักษร{'\n'}
                            <Text>      </Text>• 5.1.2 การเลิกสัญญาโดยผิดข้อสัญญาข้อใดข้อหนึ่งในกรณีที่คู่สัญญาฝ่ายใดฝ่ายหนึ่งผิดสัญญาข้อใดข้อหนึ่งตามที่ได้กำหนดไว้ในสัญญาฉบับนี้ให้คู่สัญญาอีกฝ่ายมีสิทธิในการบอกเลิกสัญญาโดยบอกกล่าวให้คู่สัญญาอีกฝ่ายชำระหนี้หรือแก้ไขการผิดสัญญาถ้าฝ่ายนั้นไม่ชำระหนี้หรือไม่แก้ไขภายในระยะเวลาที่กำหนดอีกฝ่าย
                            หนึ่งจะเลิกสัญญาก็ได้เว้นแต่กำหนดไว้เป็นอย่างอื่นในสัญญาฉบับนี้{'\n'}
                            <Text>      </Text>• 5.1.3 การเลิกสัญญาโดยไม่ต้องบอกกล่าวล่วงหน้าในกรณีที่กำหนดไว้ในข้อสัญญาข้อใดข้อหนึ่งในสัญญาฉบับนี้แสดงไว้ว่าในกรณีที่ผิดสัญญาข้อนั้นให้เลิกสัญญาเลิกกันทันทีอีกฝ่ายหนึ่งจะเลิกสัญญานั้นเสียก็ได้โดยไม่พักต้องบอกกล่าวตามข้อ 5.1.2 เลย{'\n'}
                            <Text>   </Text>5.2 วิธีการยกเลิกการใช้บริการหรือปิดบัญชีการยกเลิกการใช้บริการหรือการขอปิดบัญชีออลการ์ด (All Card)ท่านสามารถขอแบบฟอร์มการขอปิดบริการและปฏิบัติตามเงื่อนไขและขั้นตอนที่ระบุไว้ในวิธีการใช้งานทั้งนี้การปิดบัญชีออลการ์ด (All Card)ของท่านมีผลตั้งแต่วันที่ที่ท่านติดต่อขอปิดบัญชี{'\n'}
                            <Text>   </Text>5.3 การเรียกค่าเสียหายการสิ้นสุดของสัญญานี้ไม่มีผลยกเลิกหรือลบล้างสิทธิของบริษัทและความรับผิดของท่านในเงินใดๆที่ต้องชำระตามที่กำหนดในสัญญานี้{'\n'}
                            <Text>   </Text>5.4 การส่งมอบคืนเงินหรือทรัพย์สินเมื่อสัญญาสิ้นสุดลงด้วยเหตุอันเนื่องมาจากท่านฝ่าฝืนข้อกำหนดแห่งสัญญานี้เพียงบางส่วนหรือทั้งหมดหรือกรณีใดๆก็ตามหากมีเงินหรือทรัพย์สินอื่นใดที่ท่านได้รับไว้โดยมิควรได้ท่านต้องส่งมอบคืนเงินหรือทรัพย์สินเหล่านั้นทันทีด้วยค่าใช้จ่ายของท่านเองหากท่านฝ่าฝืนบริษัทมีสิทธิดำเนินการทาง
                            กฎหมายตามสมควรไม่ว่าจะเป็นการทวงถามตลอดจนฟ้องร้องดำเนินคดีโดยท่านตกลงจะไม่ยกข้อต่อสู้ใดๆขึ้นเพื่อปฏิเสธความรับผิดชอบดังกล่าว{'\n'}
                            <Text>   </Text>5.5 ค่าใช้จ่ายในการดำเนินการทางกฎหมายจากการผิดสัญญาในกรณีที่มีการผิดสัญญาและมีการดำเนินการทางกฎหมายฝ่ายที่ผิดสัญญาจะต้องรับผิดในค่าใช้จ่ายเกี่ยวกับการดำเนินการทางกฎหมายทั้งหมด{'\n\n'}
                            <Text style={{color:'#dd7534',fontWeight:'bold',fontSize:14}}>ข้อที่ 6 บทเบ็ดเตล็ด</Text>{'\n\n'}
                            <Text>   </Text>6.1 การติดต่อและแจ้งปัญหาท่านสามารถติดต่อแจ้งปัญหาได้ทันทีที่หน้า “ติดต่อเรา” (Contact Us) แต่ในการตรวจสอบรายการที่เกี่ยวข้องกับหน่วยงานอื่นๆเจ้าหน้าที่ของบริษัทจะสามารถให้บริการแก่ท่านเฉพาะเวลาทำการปกติตั้งแต่วันจันทร์ถึงวันศุกร์เท่านั้นโดยยกเว้นการให้บริการตามวันหยุดของธนาคาร{'\n'}
                            <Text>   </Text>6.2 ข้อมูลด้านความปลอดภัยของผู้ใช้บริการบริษัทเล็งเห็นและให้ความสำคัญต่อการปกป้องข้อมูลส่วนตัวของท่านเป็นอย่างยิ่งโดยจัดทำข้อมูลด้านความปลอดภัยของผู้ใช้บริการซึ่งท่านสามารถศึกษารายละเอียดของข้อมูลส่วนดังกล่าวได้ในหน้า “ข้อมูลด้านความปลอดภัย”{'\n'}
                            <Text>   </Text>6.3 การติดต่อสอบถามระเบียบ / ข้อบังคับ / เงื่อนไข / สิทธิ / ภาระผูกพัน / ข้อจำกัดสิทธิ / ข้อสงวนสิทธิ / ขอบเขตและความรับผิดของคู่สัญญาตามสัญญานี้มีผลผูกพันและกระทบต่อสิทธิ/หน้าที่และความรับผิดของท่านบริษัทขอให้ท่านทำความเข้าใจสัญญานี้อย่างละเอียดและท่านสามารถพิมพ์หรือเก็บบันทึกสัญญานี้ไว้
                            เป็นหลักฐานอ้างอิงและหากมีข้อสงสัยหรือต้องการข้อมูลเพิ่มเติมเกี่ยวกับบริการของบริษัทท่านสามารถค้นหาได้จากหน้า “คำถามที่พบบ่อย” หรือ “FAQs” หรือสอบถามได้ที่hello@allcard.app คู่สัญญาได้อ่านข้อความทั้งหมดในสัญญานี้ทำความเข้าใจและยอมรับในข้อตกลงข้อบังคับและเงื่อนไขของสัญญานี้โดยตลอดแล้วทุกประการเห็นว่าตรงตามเจตนารมณ์ของคู่สัญญา{'\n\n'}
                            *ธุรกรรมด้าน E-Money จะสามารถใช้งานได้เมื่อได้รับใบอนุญาตจากธนาคารแห่งประเทศไทยแล้วเท่านั้นโดยจะแจ้งให้ทราบภายหลัง
                        </Text>
                    </View>
                    <View style={{marginTop:100}}/>
                </ScrollView>
                    </View>
                </View>
            </SafeAreaView>
        )
    }
}